In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({
    "order_id": [1, 2, 3, 4, 5],
    "order_date": ["2023-01-01", "2023-01-05", "2023-01-07", "2023-01-15", "2023-01-20"],
    "amount": [100, 150, 200, 130, 90]
})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    5 non-null      int64
 1   order_date  5 non-null      object
 2   amount      5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [5]:
# 1. Convertis la colonne order_date en format datetime.

df["order_date"] = pd.to_datetime(df["order_date"])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    5 non-null      int64
 1   order_date  5 non-null      datetime64[ns]
 2   amount      5 non-null      int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 252.0 bytes

In [7]:
# Ajoute une colonne weekday avec le jour de la semaine.

df["weekday"] = df["order_date"].dt.day_name()

In [9]:
df

   order_id order_date  amount   weekday
0         1 2023-01-01     100    Sunday
1         2 2023-01-05     150  Thursday
2         3 2023-01-07     200  Saturday
3         4 2023-01-15     130    Sunday
4         5 2023-01-20      90    Friday

In [11]:
# Calcule le total des ventes par jour de la semaine.

df.groupby("weekday")[["amount"]].sum()

          amount
weekday
Friday        90
Saturday     200
Sunday       230
Thursday     150

In [12]:
clients = pd.DataFrame({
    "client_id": [1, 2, 3],
    "nom": ["Alice", "Bob", "Clara"]
})

commandes = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "client_id": [1, 1, 2, 3],
    "montant": [50, 75, 100, 30]
})

In [13]:
mergeClientCommand = pd.merge(clients, commandes)

In [14]:
mergeClientCommand

   client_id    nom  order_id  montant
0          1  Alice       101       50
1          1  Alice       102       75
2          2    Bob       103      100
3          3  Clara       104       30

In [19]:
# Calcule le total des dépenses par client.
groupClientMontant = mergeClientCommand.groupby("nom")[["montant"]].sum()

groupClientMontant

       montant
nom
Alice      125
Bob        100
Clara       30

In [20]:
# Trie les clients par dépense totale décroissante.
groupClientMontant.sort_values(by=["montant"])

       montant
nom
Clara       30
Bob        100
Alice      125

In [47]:
df = pd.DataFrame({
    "date": pd.date_range("2023-01-01", periods=6),
    "temperature": [10, None, None, 15, None, 20]
})

In [48]:
# Remplis les NaN par la moyenne des températures connues.
moyenne = float( df["temperature"].mean() ) # calcul la moyenne avec les valeurs qui ne sont pas NaN
print(moyenne)

df.fillna({"temperature" : moyenne }, inplace=True)

15.0

In [49]:
df

        date  temperature
0 2023-01-01         10.0
1 2023-01-02         15.0
2 2023-01-03         15.0
3 2023-01-04         15.0
4 2023-01-05         15.0
5 2023-01-06         20.0

In [36]:
df

                  date  temperature
0  2023-01-01 00:00:00         10.0
1                 15.0         15.0
2                 15.0         15.0
3  2023-01-04 00:00:00         15.0
4                 15.0         15.0
5  2023-01-06 00:00:00         20.0

In [50]:
df = pd.DataFrame({
    "année": [2022, 2022, 2023, 2023],
    "ville": ["Paris", "Lyon", "Paris", "Lyon"],
    "ventes": [200, 150, 300, 100]
})

In [51]:
# Crée un tableau croisé (pivot) avec les années en ligne, villes en colonnes, et la somme des ventes.

In [54]:
pivot = pd.pivot_table(df, index="année", columns="ville", values="ventes", aggfunc="sum")

In [55]:
pivot

ville  Lyon  Paris
année
2022    150    200
2023    100    300

In [56]:
# Calcule l’évolution en pourcentage des ventes entre 2022 et 2023 pour chaque ville.
pivot.index

Index([2022, 2023], dtype='int64', name='année')

In [61]:
# Taux d'accroissement 
t_2022 = float(pivot.loc[2022].sum()) 
t_2023 = float(pivot.loc[2023].sum())
perc = ((t_2023-t_2022)/t_2022)*100
print(f"{perc:0.2f}%")

14.29%

In [69]:
df = pd.DataFrame({
    "produit": ["Livre", "Stylo", "Ordinateur", "Clé USB"],
    "prix_ht": [20, 1.5, 900, 10],
    "TVA": [0.05, 0.2, 0.2, 0.2]
})

      produit  prix_ht   TVA  prix_ttc   catégorie
0       Livre     20.0  0.05      21.0       moyen
1       Stylo      1.5  0.20       1.8  bon marché
2  Ordinateur    900.0  0.20    1080.0        cher
3     Clé USB     10.0  0.20      12.0  bon marché